app/controllers/bookings_controller.rb

  def index
    @user = User.find(current_user)
    @bookings = @user.bookings.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "bookings" WHERE ("bookings".user_id = 1)

  def show
    @booking = Booking.find(params[:id])
    @notes = @booking.booking_notes.find(:all)
---
SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)
SELECT * FROM "booking_notes" WHERE ("booking_notes".booking_id = 1)

  def edit
    @booking = Booking.find(params[:id])
---
SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)

  def create
    @booking = Booking.new(params[:booking])
    @booking.user_id = current_user.id

    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("updated_at", "DepartureDate", "ArrivalDate", "created_at") VALUES('2009-07-21 12:43:14', '2009-08-01', '2009-07-25', '2009-07-21 12:43:14')

  def update
    @booking = Booking.find(params[:id])

    respond_to do |format|
      if @booking.update_attributes(params[:booking])
---
SELECT * FROM "bookings" WHERE ("bookings"."id" = 1)
UPDATE "bookings" SET "DepartureDate" = '2009-08-02', "updated_at" = '2009-07-21 19:49:41' WHERE "id" = 1